{"pageProps":{"postData":{"id":"2024.12.26_savings_rate","contentHtml":"<p>Наверное никто не будет спорить, что иметь сбережения хорошо, а не иметь - не очень.</p>\n<p>В подходе к накоплению сбережений люди могут допускать ошибки, которые делают больно. Но давайте по порядку.</p>\n<p>Норма сбережений — доля личных доходов, направленная на сбережение: на накопления или инвестиции, а не на потребление.</p>\n<p><strong>Норма сбережений = (Доходы - расходы) / Доходы</strong></p>\n<p>По формуле видно, что она зависит от способности зарабатывать и умения управлять тратами.\nНикому не нужно объяснять, что зарабатывать больше - хорошо, а меньше - плохо. Поэтому поговорим о второй переменной в формуле.\nРассмотрим ситуацию:</p>\n<p><strong>Disclaimer:</strong> <em>все персонажи и цифры выдуманы.</em></p>\n<p>Это Валера. Он мечтает купить Гранту 🚘</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12.26_savings_rate/1.jpeg?raw=true\" alt=\"Сгенерировано в Шедевруме\"></p>\n<p>Он работает на кассе в кафе и зарабатывает 30тр, все уходит на еду и оплату коммуналки, откладывать получается по 1.5тр.  Его норма сбережений <strong>5%</strong>. Очевидно, чтобы реализовать мечту, ему нужно что-то менять.</p>\n<p>Валера дружит с инструментами. 👷‍♂️ Он идет работать на стройку электриком за 100тр. Теперь он снимает квартиру и ходит в бары по выходным, теперь его расходы - 70тр, а норма сбережений <strong>30%</strong>. Кажется так можно и на Гранту накопить..</p>\n<p>Валера расширяется. Проходит курсы, открывает ИП и начинает брать заказы сам. Желающих очередь, Валера поднимает чек. Теперь он зарабытывает 200тр, а тратит уже 150тр. Норма сбережений <strong>25%</strong>. За год у Валеры получается накопить на Гранту. Валера молодец 🏆</p>\n<p>Валера нанимает помощника, успевает в 2 раза больше и теперь получает 300тр, а тратит с семьей уже 240тр. Норма сбережений <strong>20%</strong>.</p>\n<p>Валера изучает финансы, нанимает больше сотрудников и теперь зарабатывает 400тр. На закрытие всех базовых потребностей ему вполне достаточно.</p>\n<p>Но что дальше? Вот теперь вернемся к ловушкам, в которые может угодить Валера 🪤</p>\n<h4>Неконтролируемо повышать расходы вслед за доходом</h4>\n<p>Теперь Валера может и в рестораны ходить и в Геленджик семью 2 раза в год свозить. А еще одеваться в Хендерсоне и даже Айфон каждый год обновлять...  Проблема в том, что потребительство обладает <em>наркотическим эффектом</em> - легко начать тратить больше, когда деньги есть, но трудно отказаться от привычных благ, когда это нужно.</p>\n<p>Валера может тратить 100% здесь и сейчас, но что будет, если завтра нужны будут деньги на паркинг для Гранты, помощь близким; или в компании случится кассовый разрыв? Он был бы готов к этому, если бы его норма сбережений была достаточной для этих случаев.\nС ростом доходов Валера продолжал увеличивать расходы и незаметно норма сбережений снижалась. Эта история вполне реальная и довольно частая.</p>\n<p>Как не попасть в это ловушку? Включиться в <strong>осознанное потребление.</strong> Знать свои ежемесячные расходы, следить за динамикой, планировать рост трат, формировать \"подушку\". Это работа, которая требует времени. Если бы Валера управлял тратами как же, как ростом доходов, то его норма сбережений не уменьшалась.</p>\n<p>В идеале после каждого повышения доходов норма сбережений тоже должна <strong>повышаться</strong>, или хотя бы не меняться.</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12.26_savings_rate/3.jpeg?raw=true\" alt=\"Сгенерировано в Шедевруме\"></p>\n<h4>Быть аскетом и не менять деньги на улучшение уровня жизни</h4>\n<p>Эта ловушка встречается реже. Валера может сказать жене, что теперь мы копим на квартиру в Москве детям, поэтому никуда ездить не будем и про походы в театр забудь. Тратить при этом будем 80тр из 400тр - норма сбережений целых <strong>80%</strong>!</p>\n<p>Звучит осознанно. Но в чем здесь подвох? Наш мозг хитрая штука - он функционирует по принципу <a href=\"https://en.wikipedia.org/wiki/Reward_system\">“сделал -> получил награду”</a>, который заложен в него эволюционно. Отсутствие “вознаграждения” за приложенные усилия противоестественны, это путь к депрессии, перегоранию, отсутствию мотивации 🤕.</p>\n<p>Поэтому за увеличение доходов нужно вознаграждать себя новыми впечатлениями 🌴, улучшением качества жизни 🏠, подарками себе.</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12.26_savings_rate/2.jpeg?raw=true\" alt=\"Сгенерировано в Шедевруме\"></p>\n<h4>Заключение</h4>\n<p>Чтобы не попасть в ловушки нормы сбережений, нужно <strong>не вдаваться в крайности</strong> - сверхпотребление и недопотребление.</p>\n<p>Так какая норма сбережений “правильная”? Зависит от целей. Имея на руках нужные цифры: размер необходимой “подушки”, сумму будущих больших покупок, цели в инвестировании, можно посчитать, сколько нужно откладывать и сколько времени на это потребуется.</p>\n<p>Это важная метрика финансового состояния и есть смысл таргетировать и контролировать ее одновременно с доходами и расходами.</p>\n","title":"Ловушки нормы сбережения, которые лишают нас счастья","date":"2024-12-26","poster":"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12.26_savings_rate/min.jpeg?raw=true","tags":["finance"]}},"__N_SSG":true}