{"pageProps":{"postData":{"id":"2025.01_passionate_programmer","contentHtml":"<p>Нашел у себя в архивных заметках мысли, которые вынес из одной бородатой книги (вышла в 2009) - Чед Фаулер. “Программист-фанатик”.</p>\n<p><img src=\"https://mir-s3-cdn-cf.behance.net/project_modules/max_1200/66082267153229.5b30026f944ed.jpg\" alt=\"\"></p>\n<p>Читал ее давно. Тогда осталось впечатление, что в книге много очевидных советов. Сейчас думаю, что 15 лет назад, когда инфополе не было таким уж насыщенным, многие мысли выглядели свежо. В общем, если будет свободный вечер, то рекомендую хотя бы пролистать до интересующих тем, даже если вы не программист - большинство тем и советов универсальны, а читается легко, как диалог в баре (за чашкой чая).</p>\n<p>Решил вынести сюда 2 мысли из прошлого, которые кажутся мне не банальными и сегодня:</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2025.01_passionate_programmer/tasks.webp?raw=true\" alt=\"Сгенерировано в Шедевруме\"></p>\n<p><strong>1.</strong> Из совета 19. “Если <strong>не успеваешь - ограничь себя во времени</strong>, создай ощущение неотложности. Первый закон Паркинсона - «Работа заполняет время, отпущенное на неё».” Еще я слышал похожую вариацию, что если ты <strong>не испытываешь шока/мандража</strong> от того, сколько предстоит сделать, нужно <strong>добавить</strong> себе <strong>еще больше</strong> задач/целей.</p>\n<p>Мне в этой идее нравится два следствия, которые получается замечать у себя:</p>\n<ul>\n<li>В условиях конкретных ограничений мозг вынужден работать эффективно, без лишних пауз и отвлечений.</li>\n<li>В условиях явно-ограниченных ресурсов мозг тренируется планировать точно - без недооценок и перееоценок</li>\n</ul>\n<p><strong>2.</strong> Из совета 51. “<strong>Жизнь = проект</strong>. Надо планировать ее <strong>по гибким методологиям</strong> - заводить и актуализировать задачи, декомпозировать, брать в спринты.”</p>\n<p>Я бы сейчас переиначил эту мысль, что <strong>жизнь = продукт</strong>, который нужно растить и развивать, придумывать и декомпозировать цели, ставить приоритеты, чинить баги, проводить себе ретро и груминг старых задач. В общем все, за что мы любим (или нет) гибкие методологии.</p>\n<p>Я долго откладывал это, но, бросив блокноты/календари/Miro и аналоги, в прошлом году начал планировать цели и задачи в Яндекс Трекере. Я думал, что трекер задач избыточный инструмент для личного пользования, но сейчас мне кажется, что это самый удобный инструмент - можно заводить проекты, оценивать сложность, декомпозировать, ставить сроки, оставлять комментарии. Без костылей и на разных устройствах.</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2025.01_passionate_programmer/tracker.jpg?raw=true\" alt=\"\"></p>\n<p>Но честно сказать, не так важен инструмент, как факт <strong>перекладывания идей и планов из головы куда-то, где удобно</strong>. Экономится невероятное количество мыслетоплива в попытках запомнить все: важное, срочное и не очень.</p>\n","title":"Две заметки из старой книги","date":"2025-01-10","poster":"https://img.labirint.ru/rcimg/126cb2a49c93e2b758d4fd8a62d96a99/960x540/comments_pic/1829/origin_0_e5c83be11541464e662fbac4e3286c95.jpg?1531984668","tags":["career","reflection"]}},"__N_SSG":true}