{"pageProps":{"postData":{"id":"2024.11.20_remote_work","contentHtml":"<p>5 лет работаю в удаленном формате. Годы в университете научили организовывать свою деятельность в любых условиях, когда за спиной кто-то может шуметь, а отвлечься можно на любого не на месте лежащего кота; поэтому проблем с самоорганизацией не было.</p>\n<p>Благодаря возможности оторваться от локации и перестать тратить десятки часов в неделю на логистику я обрел:</p>\n<ul>\n<li>Возможность проводить <strong>больше времени с детьми и семьей</strong></li>\n<li><strong>+2 часа</strong> “нормальной” жизни в день</li>\n<li><strong>Больше энергии</strong> в конце дня</li>\n<li>Возможность <strong>путешествовать</strong> не отрываясь от любимого дела</li>\n</ul>\n<p>В целом, на определенном этапе карьеры, назовем его срединным, это возможность избавиться от недостатков “офисной” работы. Но я бы не рекомендовал этот формат в начале карьеры, потому что вместе с приобретениями появляются лишения:</p>\n<ul>\n<li>Как ни крути, <strong>живое общение</strong> эффективнее оффлайн с точки зрения взаимопонимания и вовлеченности. За ширмой монитора этого нет</li>\n<li><strong>Нетворкинг</strong> почти обнуляется. Да, онлайн ты знакомишься с людьми, с кем-то продолжаешь общаться вне и после смены работы. Но подавляющее большинство коллег (со многими из которых мы стали друзьями), с которыми я продолжаю держать контакт были с моих первых работ, в которые я ходил ногами. Эти знакомства могут быть полезны для карьерного роста и вообще.</li>\n</ul>\n<p>Также с определенного момента этот формат не подходит для тех, кто хочет расти в сторону руководящих позиций. Такие позиции чаще всего требуют личного присутствия в одном помещении с руководством компании. Поэтому для людей с карьерными амбициями удаленная работа не навсегда.</p>\n<p>При этом удаленная работа не всегда ограничивает в доходах - знаю людей, которые на валютной (это когда компания/заказчик не в твоей стране) удаленке получают ощутимо больше больших (но не ТОП-ов) руководителей в местных big-tech-ах. Такой уж курс валюты и коньюктура в 2024. Но часто это компании из сферы гембллинга и крипты, что не для всех.</p>\n<p>Поэтому когда меня спрашивают про удаленную работу, я обычно рекомендую смотреть не только на комфорт и плюсы, а также подумать, какую карьеру хочет человек через несколько лет.</p>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.09_remote_work/1.webp?raw=true\" alt=\"alt text\"></p>\n","title":"Удаленная работа vs офис","date":"2024-11-20","poster":"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.09_remote_work/min.webp?raw=true","tags":["career","reflection"]}},"__N_SSG":true}