{"pageProps":{"postData":{"id":"2024.12.02_welder_vs_programmer","contentHtml":"<p>В 2023 <a href=\"https://skillbox.ru/media/education/samymi-populyarnymi-u-abiturientov-2023-goda-stali-itnapravleniya/\">самыми популярными у абитуриентов стали IT‑направления</a>. В этом году от двух разных людей слышал, что школьники массово уходят из 9 класса в колледжи на \"айтишников\".</p>\n<p>Их можно понять: реклама ИТ-курсов, расказывающая о том, что у каждого тестировщика ЗП в 150 тыщ, достала до каждого; невероятный спрос на кадры в период пандемии; истории успеха у сына подруги, который работает на удаленке, попивая косос в Тайланде; IT-ипотеки (черт бы их побрал) дожимали сомневающихся.</p>\n<p>Но думаю, большинство из них совершает ошибку. Давайте расскажу, почему.</p>\n<ul>\n<li><strong>Индустрия уже не растет</strong> так бурно (скорее вышла на плато). Все, кто хотел, уже оцифровались. Инвестиций (которые раздували зарплатные ожидания) стало меньше по сравнению с началом 20-х. Зарплаты в последние 2-3 года не растут.</li>\n<li>Количество соискателей растет, а <strong>количество рабочих мест снижается</strong>. Почему растет, написано в начале; почему снижается - в предыдущем пункте. Сейчас наблюдается тренд на сокращение штата. Больше заметен в Европе, там ситуация для соискателей еще сложнее.</li>\n<li><strong>Высокий порог входа</strong> для обычного новичка. На 1 позицию младшего разработчика приходит сотня резюме. Время, когда можно было найти первую работу, за пару месяцев обучившись самостоятельно вечерами по бесплатным роликам, прошло. Чтобы быть замеченным более менее крупной ИТ-компанией, нужно чем-то выделяться (олимпиада, хорошее образование, свой НЕ учебный проект).</li>\n<li><strong>Языковые модели</strong> (Yandex GPT, GigaChat, Chat GPT) успешно дополняют квалифицированные кадры, избавляя от необходимости привлекать джунов для рутинных задач.</li>\n</ul>\n<p>Для сравнения давайте возьмем профессию сварщика:</p>\n<ul>\n<li><strong>Индустрия не подвержена колебаниям</strong> - спрос вечный, везде что-то строят, каждый день что-то выходит из строя.</li>\n<li><strong>Зарплаты растут</strong>. В Москве сварщики <a href=\"https://ura.news/news/1052850323\">зарабатывают до 500 тысяч рублей в месяц</a>. Ядро работников сейчас представляет поколения людей, которым сейчас 45-60 лет. Поколения конца 90-х и 10-х в основной массе не умеют работать руками, рабочие профессии были не в моде. К чему это приведет, думайте сами.</li>\n<li>Порог входа - умеешь что-то делать <strong>нормально и вовремя</strong> - будешь нарасхват. Курсы сварщика стоят каких-то смешных денег. В целом спрос на людей в стройке сейчас колоссальный.</li>\n</ul>\n<p><img src=\"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12_welder_vs_programmer/meme.webp?raw=true\" alt=\"alt text\"></p>\n<p>Поэтому я рекомендую отказаться от такого выбора тем, кто выбирает ее из-за зарплат / \"особых\" условий труда / быстрого социального лифта.</p>\n<p>Что же теперь, совсем нет смысла идти в ИТ? Конечно есть! Это по-прежнему <strong>хороший выбор</strong> для тех, кто выбирает эту деятельность по любви и, <strong>несмотря на трудности, получает удовольствие</strong> от работы с алгоритмами/информационными системами. У них по-прежднему есть и будет возможность сделать тут <strong>успешную карьеру</strong> (как и в любой другой сфере).</p>\n<p><img src=\"https://habrastorage.org/webt/d6/ct/zm/d6ctzme-5lvtpmrynrn0narhdvw.png\" alt=\"Сгенерировано в Шедевруме\"></p>\n","title":"Не агитируйте детей в программисты","date":"2024-1202","poster":"https://github.com/mmarashan/blog.pages/blob/main/images/blog/2024.12_welder_vs_programmer/min.webp?raw=true","tags":["career"]}},"__N_SSG":true}